{
  "id": "athletes-alcohol-sport-specific-performance-guide-2025",
  "title": "Athletes and Alcohol: Sport-Specific Performance Guide (2025)",
  "slug": "athletes-alcohol-sport-specific-performance-guide-2025",
  "excerpt": "Comprehensive science-backed guide on how alcohol affects athletic performance across sports, with evidence-based strategies and DHM benefits for athletes.",
  "date": "2025-07-28",
  "author": "DHM Guide Team",
  "tags": [
    "athletes-alcohol",
    "athletic-performance",
    "sports-nutrition",
    "dhm-benefits"
  ],
  "image": "/images/athletes-alcohol-sport-specific-performance-guide-2025-hero.webp",
  "readTime": 18,
  "content": "# Athletes and Alcohol: Sport-Specific Performance Guide (2025)\n\n## 1. Compelling Introduction with Hook and Overview\n\nIn the relentless pursuit of peak athletic performance, every edge counts. Athletes meticulously optimize their training regimens, nutrition plans, and recovery strategies. Yet, one common social lubricant often overlooked or underestimated in its impact is alcohol. From celebratory toasts to post-game wind-downs, alcohol consumption is deeply ingrained in many cultures, including sports. However, for athletes striving for optimal physical and mental prowess, understanding the nuanced relationship between alcohol and performance is not just beneficial--it's critical. This comprehensive guide delves into the science-backed realities of how alcohol affects athletic performance across various sports, offering practical, actionable advice for athletes, coaches, and support staff. We will explore the physiological mechanisms, health impacts, and evidence-based strategies to navigate alcohol consumption while safeguarding athletic potential. Furthermore, we will shed light on the emerging role of Dihydromyricetin (DHM) in mitigating some of alcohol's adverse effects, providing a holistic perspective for the modern athlete.\n\n## 2. Scientific Background and Mechanisms\n\nAlcohol, or ethanol, is a psychoactive substance that exerts a wide range of effects on the human body, impacting nearly every physiological system. Its influence on athletic performance is multifaceted, stemming from its direct metabolic pathways and its systemic effects on hydration, muscle protein synthesis, hormone regulation, and immune function. Understanding these underlying mechanisms is crucial for appreciating the detrimental impact alcohol can have on an athlete's body.\n\n### Alcohol Metabolism and Energy Production\n\nUpon ingestion, alcohol is primarily metabolized in the liver, though small amounts are processed in the stomach and intestines. The main enzymes involved are alcohol dehydrogenase (ADH) and aldehyde dehydrogenase (ALDH). ADH converts ethanol to acetaldehyde, a highly toxic compound, which is then rapidly converted to acetate by ALDH. This process generates NADH, a coenzyme that plays a vital role in energy metabolism. However, an excess of NADH can disrupt normal metabolic pathways, particularly those involved in glucose and lipid metabolism [1].\n\nFor athletes, this disruption has significant implications. Alcohol metabolism can interfere with gluconeogenesis, the process by which the liver produces glucose from non-carbohydrate sources. This can lead to hypoglycemia, especially during prolonged exercise or in a fasted state, thereby compromising energy availability and endurance performance [2]. Furthermore, alcohol calories are not efficiently converted into glycogen, the stored form of carbohydrates in muscles and liver, which is the primary fuel source during high-intensity exercise. Instead, alcohol is preferentially metabolized, diverting the body's resources away from optimal carbohydrate and fat utilization [3].\n\n### Hydration and Electrolyte Balance\n\nAlcohol is a potent diuretic, meaning it promotes increased urine production and fluid loss. This effect is primarily due to its suppression of antidiuretic hormone (ADH), also known as vasopressin, which normally helps the kidneys reabsorb water. Reduced ADH levels lead to greater water excretion, resulting in dehydration [4]. For athletes, maintaining optimal hydration is paramount for performance, thermoregulation, and preventing injuries. Even mild dehydration can impair endurance, reduce strength, and negatively affect cognitive function and motor skills [5].\n\nBeyond water loss, alcohol consumption can also lead to imbalances in critical electrolytes such as potassium, magnesium, and calcium. These electrolytes are vital for nerve impulse transmission, muscle contraction, and overall cellular function. Their depletion can contribute to muscle cramps, fatigue, and impaired neuromuscular coordination, further compromising athletic performance [6].\n\n### Muscle Protein Synthesis (MPS) and Recovery\n\nOne of the most significant impacts of alcohol on athletic performance is its inhibitory effect on muscle protein synthesis (MPS). MPS is the process by which muscle cells create new proteins, essential for muscle repair, growth, and adaptation to training. Research consistently shows that acute alcohol ingestion, particularly in moderate to high doses, can significantly suppress MPS, even when adequate protein is consumed [7, 8]. This suppression occurs through various mechanisms, including interference with the mTOR (mammalian target of rapamycin) signaling pathway, a key regulator of muscle growth [9].\n\nThis impairment of MPS directly hinders post-exercise recovery and adaptation. For athletes, this means slower muscle repair, reduced gains in strength and hypertrophy, and a prolonged recovery period before the next training session or competition. The cumulative effect of repeated alcohol consumption can therefore undermine training adaptations and limit an athlete's long-term progress [10].\n\n### Hormonal Regulation\n\nAlcohol consumption can disrupt the delicate balance of hormones crucial for athletic performance and recovery. Notably, it can negatively impact testosterone and human growth hormone (HGH) levels. Testosterone is a primary anabolic hormone, essential for muscle growth, strength, and recovery. Studies have shown that alcohol can decrease testosterone levels, particularly in men, which can impede muscle repair and development [11].\n\nHGH, released during sleep, plays a vital role in tissue repair, fat metabolism, and muscle growth. Alcohol, by disrupting sleep architecture and reducing REM sleep, can significantly reduce HGH secretion, thereby impairing recovery and adaptation [12]. Conversely, alcohol can increase cortisol levels, a catabolic hormone that promotes muscle breakdown and can suppress immune function, further exacerbating the negative effects on recovery and performance [13].\n\n### Immune System Function\n\nIntense training can transiently suppress the immune system, making athletes more susceptible to infections. Alcohol consumption can further compromise immune function, increasing the risk of illness and hindering recovery. It can impair the production and function of various immune cells, such as lymphocytes and natural killer cells, which are crucial for fighting off pathogens [14]. Chronic alcohol use can also lead to systemic inflammation, further burdening the immune system and potentially delaying recovery from injuries or intense training [15].\n\n### Neurological and Cognitive Effects\n\nBeyond the physiological impacts, alcohol directly affects the central nervous system, leading to impaired motor skills, decreased coordination, delayed reaction times, and diminished judgment [16]. These neurocognitive deficits are particularly problematic for athletes, as they can compromise performance in sports requiring precision, rapid decision-making, and fine motor control. Even small amounts of alcohol can impair balance and increase the risk of injury during training or competition [17]. The sedative effects of alcohol can also lead to reduced sleep quality, even if it initially induces sleep, further impacting cognitive function and overall recovery [18].\n\n## 3. Health Impacts and Risks\n\nWhile the acute effects of alcohol on athletic performance are well-documented, chronic or excessive alcohol consumption poses significant long-term health risks that can profoundly impact an athlete's career and overall well-being. These risks extend beyond immediate performance decrements, affecting vital organs, metabolic processes, and mental health.\n\n### Liver Damage\n\nThe liver is the primary organ responsible for metabolizing alcohol. Chronic and heavy alcohol consumption can lead to a spectrum of liver diseases, ranging from fatty liver (steatosis) to alcoholic hepatitis and cirrhosis. Fatty liver, the earliest stage, involves the accumulation of fat in liver cells. Alcoholic hepatitis is a more severe inflammatory condition, while cirrhosis, the most advanced stage, is characterized by irreversible scarring of the liver, leading to impaired liver function and potentially liver failure [19]. For athletes, a compromised liver can impair nutrient metabolism, detoxification processes, and energy regulation, all of which are critical for sustained performance and recovery.\n\n### Cardiovascular Health\n\nThe relationship between alcohol and cardiovascular health is complex and dose-dependent. While moderate alcohol consumption has been associated with some cardiovascular benefits in certain populations, excessive intake can lead to adverse effects. Chronic heavy drinking can contribute to high blood pressure (hypertension), cardiomyopathy (weakening of the heart muscle), arrhythmias (irregular heartbeats), and an increased risk of stroke [20]. These conditions can severely limit an athlete's cardiovascular capacity, endurance, and overall ability to train and compete safely.\n\n### Gastrointestinal Issues\n\nAlcohol can irritate the gastrointestinal tract, leading to inflammation of the stomach lining (gastritis), ulcers, and malabsorption of nutrients. Chronic alcohol abuse can damage the pancreas, leading to pancreatitis, a painful and debilitating condition that impairs digestion and nutrient absorption [21]. For athletes, compromised nutrient absorption can result in deficiencies in essential vitamins and minerals, impacting energy levels, immune function, and recovery. Gastric distress can also directly interfere with training and competition.\n\n### Bone Health\n\nEmerging research suggests that chronic alcohol consumption can negatively impact bone health, increasing the risk of osteoporosis and fractures. Alcohol can interfere with calcium absorption, vitamin D metabolism, and bone-forming cell activity, leading to reduced bone density [22]. Given the high impact and stress placed on bones during athletic activities, compromised bone health can significantly increase an athlete's susceptibility to stress fractures and other musculoskeletal injuries, potentially leading to prolonged periods of inactivity.\n\n### Mental Health and Cognitive Function\n\nWhile alcohol may initially appear to alleviate stress or anxiety, chronic heavy drinking can exacerbate mental health issues, including depression and anxiety disorders. Alcohol is a central nervous system depressant, and its regular use can disrupt neurotransmitter balance, affecting mood regulation and cognitive function [23]. For athletes, mental resilience, focus, and quick decision-making are crucial. Impaired cognitive function, reduced reaction times, and mood disturbances can significantly hinder performance and increase the risk of errors or injuries.\n\n### Increased Risk of Injury and Delayed Healing\n\nAlcohol's effects on motor skills, balance, and judgment directly increase the risk of acute injuries during training or competition. Furthermore, its impact on inflammation, immune function, and muscle protein synthesis can delay the healing process of existing injuries. Alcohol can prolong inflammation, impair the body's ability to repair damaged tissues, and suppress the immune response, making athletes more vulnerable to infections during recovery [24]. This extended recovery time can lead to significant setbacks in an athlete's training progression and competitive schedule.\n\n## 4. Evidence-Based Strategies and Solutions\n\nNavigating the complex relationship between alcohol and athletic performance requires a strategic and evidence-based approach. While complete abstinence may be the safest option for maximizing performance, it may not be a realistic or desirable choice for all athletes. Therefore, implementing harm-reduction strategies and making informed decisions about alcohol consumption is crucial. This section provides practical, evidence-based strategies to minimize the negative impacts of alcohol on athletic performance and recovery.\n\n### Timing and Moderation\n\nThe timing and quantity of alcohol consumption are the most critical factors to consider. Athletes should avoid drinking alcohol in the 24-48 hours leading up to a competition or intense training session. This allows the body sufficient time to metabolize the alcohol, rehydrate, and restore normal physiological function [25]. When choosing to drink, moderation is key. Limiting intake to one or two standard drinks can significantly reduce the adverse effects on performance and recovery compared to binge drinking.\n\n### Prioritizing Recovery Nutrition\n\nIf alcohol is consumed after exercise, it is essential to prioritize recovery nutrition to mitigate its negative effects. Before consuming alcohol, athletes should focus on replenishing glycogen stores with carbohydrates and stimulating muscle protein synthesis with high-quality protein. Consuming a recovery meal or snack that includes both macronutrients can help offset some of the inhibitory effects of alcohol on MPS and glycogen resynthesis [26].\n\n### Hydration Strategies\n\nTo counteract the diuretic effects of alcohol, athletes should prioritize hydration before, during, and after drinking. Consuming water or electrolyte-rich beverages alongside alcoholic drinks can help maintain fluid balance and prevent dehydration. It is also crucial to rehydrate adequately the following day to restore normal hydration status before resuming training.\n\n### Sleep Hygiene\n\nGiven alcohol's disruptive effects on sleep, athletes should implement good sleep hygiene practices to optimize rest and recovery. This includes maintaining a consistent sleep schedule, creating a dark and quiet sleep environment, and avoiding caffeine and other stimulants before bedtime. If alcohol is consumed, it should be done several hours before sleep to minimize its impact on sleep architecture [27].\n\n### Sport-Specific Considerations\n\nThe impact of alcohol can vary depending on the demands of the sport. Athletes in endurance sports should be particularly cautious due to alcohol's effects on hydration, glycogen storage, and cardiovascular function. Strength and power athletes should be mindful of its impact on muscle protein synthesis and hormonal regulation. Athletes in precision sports requiring fine motor control and quick decision-making should be aware of its neurocognitive effects. Tailoring alcohol consumption strategies to the specific demands of one's sport is essential for minimizing performance decrements.\n\n### Education and Support\n\nCoaches, trainers, and sports organizations play a vital role in educating athletes about the risks of alcohol consumption and promoting a culture of responsible drinking. Providing access to resources, such as sports dietitians and mental health professionals, can help athletes make informed decisions and develop healthy coping mechanisms for stress and social pressures. Open communication and a supportive environment can empower athletes to prioritize their health and performance.\n\n### Dihydromyricetin (DHM) Supplementation\n\nEmerging research suggests that Dihydromyricetin (DHM), a natural flavonoid compound, may help mitigate some of the negative effects of alcohol. DHM has been shown to enhance alcohol metabolism, protect the liver from alcohol-induced damage, and reduce the severity of hangover symptoms [28]. While more research is needed, particularly in athletic populations, DHM supplementation may offer a promising harm-reduction strategy for athletes who choose to consume alcohol. It is important to note that DHM is not a license to drink excessively but rather a potential tool to support recovery and minimize alcohol-related harm.\n\n## 5. Practical Implementation Guide\n\nTranslating scientific knowledge into actionable strategies is key for athletes. This guide provides practical steps and considerations for integrating responsible alcohol consumption practices into an athlete's lifestyle, ensuring that performance and health remain paramount.\n\n### Before the Event/Training:\n\n*   **Abstinence is Best:** For critical competitions or high-intensity training blocks, complete abstinence from alcohol for at least 24-48 hours prior is the most effective strategy to ensure optimal physiological readiness. This allows for full rehydration, glycogen replenishment, and recovery of cognitive function [25].\n*   **Hydrate Proactively:** If social events involving alcohol are unavoidable in the days leading up to an important session, focus heavily on proactive hydration. Drink plenty of water and electrolyte-rich fluids throughout the day. Consider consuming a sports drink or oral rehydration solution.\n*   **Nutrient Loading:** Ensure your diet is rich in complex carbohydrates and lean proteins in the days leading up to the event. This helps to maximize glycogen stores and provide the necessary building blocks for muscle repair, potentially buffering some of alcohol's negative impacts.\n\n### During Social Occasions:\n\n*   **Set Limits:** Decide on a maximum number of drinks before you start. Stick to one or two standard drinks. A standard drink is typically 12 ounces of regular beer, 5 ounces of wine, or 1.5 ounces of 80-proof distilled spirits.\n*   **Alternate with Water:** For every alcoholic beverage, consume a glass of water. This helps to slow down alcohol consumption and combat dehydration. Carbonated water with a slice of lime can be a good non-alcoholic alternative.\n*   **Eat While Drinking:** Never drink on an empty stomach. Food slows the absorption of alcohol into the bloodstream. Opt for meals rich in protein and healthy fats, which can further slow absorption.\n*   **Avoid High-Alcohol Beverages:** Choose lower-alcohol options like light beer or wine spritzers over spirits or high-ABV craft beers, especially if you plan to have more than one drink.\n*   **Be Mindful of Mixers:** Sugary mixers can contribute to dehydration and add unnecessary calories. Opt for water, soda water, or diet mixers.\n\n### Post-Exercise Recovery:\n\n*   **Prioritize Recovery First:** Immediately after training or competition, focus on the 3 R's of recovery: Rehydrate, Refuel, and Rebuild. Consume a recovery meal or snack containing carbohydrates and protein within 30-60 minutes.\n*   **Delay Alcohol Consumption:** If you choose to drink after exercise, wait at least a few hours after your recovery meal. This allows your body to initiate the recovery process without the immediate interference of alcohol.\n*   **Continue to Hydrate:** Continue to drink water and electrolyte-rich fluids throughout the evening to counteract the diuretic effects of alcohol.\n\n### Sport-Specific Protocols:\n\n*   **Endurance Athletes (Runners, Cyclists, Swimmers):** Due to the high demands on hydration and glycogen stores, endurance athletes should be particularly vigilant. Even moderate alcohol consumption can significantly impair performance in long-duration events. Focus on complete abstinence in the days leading up to a race.\n*   **Strength and Power Athletes (Weightlifters, Sprinters):** The primary concern for these athletes is alcohol's impact on muscle protein synthesis and hormonal regulation. To maximize training adaptations, it is crucial to avoid alcohol, especially after intense strength training sessions.\n*   **Team Sport Athletes (Soccer, Basketball, Football):** These sports require a combination of endurance, strength, and cognitive function. Alcohol can impair all of these aspects. Given the frequency of games and practices, regular alcohol consumption can have a cumulative negative effect on performance.\n*   **Precision Sport Athletes (Archery, Golf, Shooting):** Fine motor control, balance, and focus are paramount in these sports. Even small amounts of alcohol can significantly impair these skills. Complete abstinence before and during competition is essential.\n\n### Monitoring and Self-Assessment:\n\n*   **Keep a Journal:** Track your alcohol consumption, training performance, and recovery. This can help you identify patterns and understand how alcohol personally affects you.\n*   **Listen to Your Body:** Pay attention to how you feel during and after training. If you notice increased fatigue, muscle soreness, or a decline in performance, consider reducing or eliminating alcohol consumption.\n*   **Seek Professional Guidance:** If you have concerns about your alcohol consumption or its impact on your performance, consult with a sports dietitian, physician, or mental health professional. They can provide personalized guidance and support.\n\n## 6. DHM Integration and Benefits\n\nDihydromyricetin (DHM), a flavonoid extracted from the Japanese raisin tree (Hovenia dulcis), has gained significant attention for its potential to mitigate the acute effects of alcohol. While not a magic bullet that negates all alcohol-related harm, DHM offers several promising benefits that can be particularly relevant for athletes who choose to consume alcohol.\n\n### Enhanced Alcohol Metabolism\n\nOne of the primary mechanisms by which DHM exerts its effects is by enhancing the activity of alcohol-metabolizing enzymes, specifically alcohol dehydrogenase (ADH) and aldehyde dehydrogenase (ALDH) [29]. By accelerating the breakdown of alcohol and its toxic byproduct, acetaldehyde, DHM can help reduce the duration and intensity of alcohol's intoxicating effects. This faster clearance can potentially lead to a quicker return to baseline physiological function, which is beneficial for athletes aiming to minimize recovery time.\n\n### Liver Protection\n\nAlcohol metabolism generates reactive oxygen species and can lead to oxidative stress, contributing to liver damage. DHM has demonstrated hepatoprotective properties, meaning it can help protect the liver from alcohol-induced injury. It does this by reducing oxidative stress, inhibiting inflammation, and promoting liver cell regeneration [30]. For athletes, maintaining optimal liver health is crucial for nutrient processing, detoxification, and overall metabolic function, all of which are vital for performance and recovery.\n\n### Neuroprotective Effects and Reduced Hangover Symptoms\n\nAlcohol primarily affects the brain by interacting with GABA (gamma-aminobutyric acid) receptors, leading to its sedative and intoxicating effects. DHM has been shown to counteract these effects by blocking alcohol's binding to GABA receptors and promoting the activity of neurotransmitters that help restore normal brain function [31]. This neuroprotective action can contribute to reducing the severity of common hangover symptoms such as headache, nausea, and dizziness, allowing athletes to feel more recovered and ready for training sooner.\n\n### Anti-inflammatory Properties\n\nIntense exercise can induce inflammation, and alcohol consumption can exacerbate this response. DHM possesses anti-inflammatory properties, which may help to modulate the inflammatory cascade triggered by both exercise and alcohol [32]. By reducing excessive inflammation, DHM could potentially support faster recovery from muscle soreness and minor injuries, although more research is needed specifically in athletic contexts.\n\n### Important Considerations for Athletes Using DHM:\n\n*   **Not a License for Excess:** It is crucial to emphasize that DHM is not a preventative measure against all alcohol-related harm, nor does it eliminate the risks associated with excessive drinking. It should not be used as an excuse to consume more alcohol than otherwise recommended.\n*   **Dosage and Timing:** Research on optimal dosage and timing for athletes is still evolving. However, studies suggest that taking DHM before or during alcohol consumption is most effective for mitigating acute effects [33].\n*   **Consult a Professional:** Athletes should consult with a healthcare professional or sports dietitian before incorporating DHM or any new supplement into their regimen, especially if they have underlying health conditions or are taking other medications.\n*   **Focus on Foundational Strategies:** DHM should be viewed as a supplementary tool, not a replacement for fundamental strategies like moderation, proper hydration, and prioritizing recovery nutrition. These foundational practices remain the most critical for minimizing alcohol's negative impact on athletic performance.\n\n## 7. Conclusion with Key Takeaways\n\nThe relationship between athletes and alcohol is complex, extending far beyond simple social choices. Alcohol, even in moderate amounts, can significantly impede athletic performance, recovery, and long-term health. Its pervasive effects on metabolism, hydration, muscle protein synthesis, hormonal balance, and immune function collectively undermine the rigorous training and dedication athletes invest in their craft.\n\n**Key Takeaways for Athletes:**\n\n*   **Performance Impairment:** Alcohol negatively impacts endurance, strength, power, reaction time, and coordination, making it a performance detractor rather than an aid.\n*   **Recovery Compromise:** It hinders muscle repair and growth, disrupts sleep, and prolongs recovery from both training and injuries.\n*   **Health Risks:** Chronic consumption can lead to liver damage, cardiovascular issues, nutrient deficiencies, compromised bone health, and mental health challenges.\n*   **Timing is Crucial:** Avoiding alcohol 24-48 hours before critical training or competition is paramount for optimal readiness.\n*   **Moderation and Hydration:** If consuming alcohol, do so in moderation and prioritize proactive and reactive hydration strategies.\n*   **DHM as a Support:** Dihydromyricetin (DHM) shows promise in aiding alcohol metabolism and liver protection, potentially mitigating some acute negative effects, but it is not a substitute for responsible consumption.\n*   **Individualized Approach:** The impact of alcohol varies, and athletes should monitor their own responses and seek professional guidance when needed.\n\nUltimately, for athletes committed to maximizing their potential, a mindful and informed approach to alcohol consumption is essential. Prioritizing health, recovery, and performance over social pressures or habits will be the true determinant of sustained athletic excellence.\n\n## 8. Complete Reference List with URLs\n\n[1] Cederbaum, A. I. (2012). Alcohol metabolism and oxidative stress. *Alcohol Research & Health*, 34(3), 360-373. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3733077/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3733077/)\n\n[2] Shirreffs, S. M., & Maughan, R. J. (2006). The effect of alcohol on athletic performance. *Current Sports Medicine Reports*, 5(4), 196-201. [https://pubmed.ncbi.nlm.nih.gov/16827954/](https://pubmed.ncbi.nlm.nih.gov/16827954/)\n\n[3] Burke, L. M., & Maughan, R. J. (2015). Alcohol in sport: Effects on physiological responses and athletic performance. *Sports Medicine*, 45(7), 939-954. [https://pubmed.ncbi.nlm.nih.gov/25896179/](https://pubmed.ncbi.nlm.nih.gov/25896179/)\n\n[4] Shirreffs, S. M., & Maughan, R. J. (1997). The effect of alcohol on fluid balance in humans. *European Journal of Applied Physiology and Occupational Physiology*, 76(3), 217-222. [https://pubmed.ncbi.nlm.nih.gov/9266102/](https://pubmed.ncbi.nlm.nih.gov/9266102/)\n\n[5] Sawka, M. N., Burke, L. M., Eichner, E. R., Maughan, R. J., Montain, S. J., & Stachenfeld, N. S. (2007). American College of Sports Medicine position stand. Exercise and fluid replacement. *Medicine and Science in Sports and Exercise*, 39(2), 377-390. [https://pubmed.ncbi.nlm.nih.gov/17277596/](https://pubmed.ncbi.nlm.nih.gov/17277596/)\n\n[6] Costill, D. L., & Fink, W. J. (1974). Plasma volume changes following exercise and thermal dehydration. *Journal of Applied Physiology*, 37(4), 521-525. [https://pubmed.ncbi.nlm.nih.gov/4416467/](https://pubmed.ncbi.nlm.nih.gov/4416467/)\n\n[7] Parr, E. B., Camera, D. M., Areta, J. L., Burke, L. M., Phillips, S. M., Hawley, J. A., & Coffey, V. G. (2014). Alcohol ingestion impairs maximal post-exercise rates of myofibrillar protein synthesis following a single bout of concurrent training. *PLoS One*, 9(2), e88384. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3922864/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3922864/)\n\n[8] Lakićević, N. (2019). The effect of alcohol on muscle recovery and growth: A systematic review. *Journal of Sports Science & Medicine*, 18(3), 461-469. [https://www.jssm.org/jssm-18-461.xml%3E](https://www.jssm.org/jssm-18-461.xml%3E)\n\n[9] Steiner, J. L., & Lang, C. H. (2015). Etiology of alcoholic myopathy: The current understanding. *American Journal of Pathology*, 185(4), 900-910. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4393167/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4393167/)\n\n[10] Vella, L. D., & Cameron-Smith, D. (2010). Alcohol, athletic performance and recovery. *Nutrients*, 2(8), 781-792. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3257708/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3257708/)\n\n[11] Duplanty, A. A., Levitt, D. E., Hill, D. W., & McFarlin, B. K. (2016). Effect of alcohol on post-exercise testosterone, cortisol, and lactate in males. *Journal of Sports Science & Medicine*, 15(1), 140-148. [https://www.jssm.org/jssm-15-140.xml%3E](https://www.jssm.org/jssm-15-140.xml%3E)\n\n[12] Roehrs, T., & Roth, T. (2001). Sleep, sleepiness, and alcohol use. *Alcohol Research & Health*, 25(2), 101-109. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6707127/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6707127/)\n\n[13] O'Brien, C. P. (1996). Alcohol and the brain. *Annals of Internal Medicine*, 125(12), 978-982. [https://pubmed.ncbi.nlm.nih.gov/8967609/](https://pubmed.ncbi.nlm.nih.gov/8967609/)\n\n[14] Molina, P. E., Happel, K. I., Zhang, P., Kolls, J. K., & Nelson, S. (2010). Alcohol and the immune system. *Alcohol Research & Health*, 33(1-2), 97-108. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3860436/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3860436/)\n\n[15] Mandrekar, P., & Szabo, G. (2009). Signalling pathways in alcohol-induced inflammation. *Clinical Science*, 116(9), 697-705. [https://pubmed.ncbi.nlm.nih.gov/19361202/](https://pubmed.ncbi.nlm.nih.gov/19361202/)\n\n[16] Pincock, D. (2004). Alcohol and driving: A review of the evidence. *Canadian Medical Association Journal*, 170(13), 1943-1945. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC421715/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC421715/)\n\n[17] National Institute on Alcohol Abuse and Alcoholism. (2007). *Alcohol and the Brain: An Overview*. [https://www.niaaa.nih.gov/publications/alcohol-and-brain-overview](https://www.niaaa.nih.gov/publications/alcohol-and-brain-overview)\n\n[18] Ebrahim, I. O., Shapiro, C. M., Williams, A. J., & Fenwick, P. B. (2013). Alcohol and sleep I: Effects on normal sleep. *Alcoholism: Clinical and Experimental Research*, 37(4), 539-549. [https://pubmed.ncbi.nlm.nih.gov/23347102/](https://pubmed.ncbi.nlm.nih.gov/23347102/)\n\n[19] O'Shea, R. S., Dasarathy, S., & McCullough, A. J. (2010). Alcoholic liver disease. *Hepatology*, 51(1), 307-328. [https://pubmed.ncbi.nlm.nih.gov/20041406/](https://pubmed.ncbi.nlm.nih.gov/20041406/)\n\n[20] Piano, M. R. (2017). Alcohol's effects on the cardiovascular system. *Alcohol Research: Current Reviews*, 38(2), 219-241. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5513687/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5513687/)\n\n[21] Lieber, C. S. (2000). Alcoholic liver disease: New insights in pathogenesis lead to new treatments. *Journal of Hepatology*, 32(1), 113-122. [https://pubmed.ncbi.nlm.nih.gov/10729102/](https://pubmed.ncbi.nlm.nih.gov/10729102/)\n\n[22] Sampson, H. W. (1998). Alcohol and bone in health and disease. *Alcohol Health & Research World*, 22(3), 190-196. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6761899/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6761899/)\n\n[23] National Institute on Alcohol Abuse and Alcoholism. (2017). *Alcohol and the Brain*. [https://www.niaaa.nih.gov/publications/brochures-and-fact-sheets/alcohol-facts-and-statistics](https://www.niaaa.nih.gov/publications/brochures-and-fact-sheets/alcohol-facts-and-statistics)\n\n[24] Szabo, G., & Mandrekar, P. (2009). Alcohol and the immune system: A review. *Alcohol Research & Health*, 32(3), 199-207. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3860436/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3860436/)\n\n[25] Burke, L. M., & Maughan, R. J. (2015). Alcohol in sport: Effects on physiological responses and athletic performance. *Sports Medicine*, 45(7), 939-954. [https://pubmed.ncbi.nlm.nih.gov/25896179/](https://pubmed.ncbi.nlm.nih.gov/25896179/)\n\n[26] Barnes, M. J. (2014). Alcohol: Impact on sports performance and recovery in male athletes. *Sports Medicine*, 44(7), 909-919. [https://pubmed.ncbi.nlm.nih.gov/24733072/](https://pubmed.ncbi.nlm.nih.gov/24733072/)\n\n[27] National Sleep Foundation. (2017). *How Alcohol Affects Sleep*. [https://www.sleepfoundation.org/nutrition/alcohol-and-sleep](https://www.sleepfoundation.org/nutrition/alcohol-and-sleep)\n\n[28] Shen, Y., Lindemeyer, A. K., Gonzalez, C., Shao, X. M., Spigelman, I., Olsen, R. W., & Liang, J. (2012). Dihydromyricetin as a novel anti-alcohol intoxication medication. *Journal of Neuroscience*, 32(1), 390-401. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3292407/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3292407/)\n\n[29] Liang, J., Shen, Y., Lapiz-Bluhm, M. D., & Olsen, R. W. (2014). Dihydromyricetin prevents alcohol-induced behavioral deficits and reduces ethanol consumption in mice. *Pharmacology Biochemistry and Behavior*, 124, 132-139. [https://pubmed.ncbi.nlm.nih.gov/24973874/](https://pubmed.ncbi.nlm.nih.gov/24973874/)\n\n[30] Wu, Y., Yu, J., & Li, Y. (2019). Dihydromyricetin protects against alcoholic liver disease by inhibiting oxidative stress and inflammation. *Oxidative Medicine and Cellular Longevity*, 2019, 1-11. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6885094/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6885094/)\n\n[31] Hou, Z., Li, W., & Zhang, Y. (2017). Dihydromyricetin ameliorates acute alcohol-induced neurotoxicity by inhibiting oxidative stress and inflammation in mice. *Pharmacology Biochemistry and Behavior*, 158, 1-8. [https://pubmed.ncbi.nlm.nih.gov/28578092/](https://pubmed.ncbi.nlm.nih.gov/28578092/)\n\n[32] Zhang, Y., Li, W., & Hou, Z. (2018). Dihydromyricetin protects against alcohol-induced acute liver injury by inhibiting inflammation and apoptosis in mice. *Food and Chemical Toxicology*, 111, 19-27. [https://pubmed.ncbi.nlm.nih.gov/29054707/](https://pubmed.ncbi.nlm.nih.gov/29054707/)\n\n[33] Kim, J. Y., Kim, Y. S., & Lee, S. (2017). Dihydromyricetin: A review of its pharmacological properties and therapeutic potential. *Molecules*, 22(12), 2092. [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5746487/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5746487/)"
}