{
  "id": "4d96642f-f79c-4517-a0f0-2c756a578912",
  "slug": "social-media's-unseen-influence-navigating-alcohol-wellness-in-the-digital-age",
  "title": "Social Media's Unseen Influence: Navigating Alcohol Wellness in the Digital Age",
  "excerpt": "A comprehensive guide exploring the intricate relationship between social media and alcohol wellness, offering strategies to navigate digital influences and foster healthier habits.",
  "date": "2025-07-29",
  "author": "Manus",
  "image": "/images/social-media-drinking-hero.webp",
  "tags": [
    "social media",
    "alcohol wellness",
    "mindful drinking",
    "DHM",
    "digital culture",
    "health",
    "addiction",
    "youth"
  ],
  "readTime": 24,
  "content": "# Social Media's Unseen Influence: Navigating Alcohol Wellness in the Digital Age\n\n## Introduction: The Digital Mirror – Reflecting Our Drinking Habits\n\nIn an era defined by constant connectivity, social media platforms have woven themselves inextricably into the fabric of our daily lives. From sharing personal milestones to consuming news and entertainment, digital spaces have become primary arenas for human interaction and identity formation. This pervasive influence extends far beyond mere communication, subtly shaping our perceptions, behaviors, and even our relationship with substances like alcohol. The digital mirror, reflecting our curated lives, often presents a distorted image of alcohol consumption, normalizing behaviors that may be detrimental to individual and public health.\n\n### The Pervasive Influence of Social Media on Daily Life\n\nSocial media's integration into our routines is undeniable. Platforms like Facebook, Instagram, TikTok, and X (formerly Twitter) are not just tools; they are environments where a significant portion of our social and cultural lives unfold. For adolescents and young adults, who have grown up immersed in this digital landscape, these platforms are particularly influential. They serve as primary sources of information, social validation, and peer interaction. This constant exposure to online content, including that related to alcohol, can have profound and often unexamined effects on their attitudes and behaviors [1].\n\n### The Growing Concern: Alcohol Consumption in the Digital Sphere\n\nAmidst the vibrant tapestry of online life, a growing concern emerges: the pervasive presence and portrayal of alcohol. Research indicates that social media is awash with alcohol-related content, ranging from direct advertising by beverage companies to user-generated posts depicting drinking in social, often celebratory, contexts [2]. This constant visual and narrative exposure contributes to increased drinking among consumers, with studies showing a direct correlation between posting alcohol-related content and higher rates of consumption, cravings, and even alcohol addiction [2]. The digital sphere, therefore, is not merely a passive reflection of drinking culture; it actively shapes and amplifies it.\n\n### Purpose of This Guide: Navigating Alcohol Wellness in a Socially-Connected World\n\nThis comprehensive guide aims to shed light on the intricate relationship between social media and alcohol wellness. We will delve into how digital culture shapes drinking behaviors, exploring the psychological mechanisms at play and the societal implications of this evolving dynamic. Furthermore, we will examine the emerging trends of mindful drinking and sobriety, particularly among younger generations, as a counter-narrative to the prevailing digital alcohol culture. Crucially, this guide will provide actionable advice and practical strategies for individuals to navigate the digital minefield, fostering a healthier relationship with both social media and alcohol. We will also naturally integrate the benefits of Dihydromyricetin (DHM) where relevant, focusing on its evidence-based role in supporting liver health and alcohol metabolism, without promoting its use as a compensatory measure for excessive drinking.\n\n## The Digital Landscape of Alcohol: Exposure and Normalization\n\nThe digital world has become a primary battleground for influencing perceptions and behaviors related to alcohol. Unlike traditional media, social media offers a dynamic, interactive, and highly personalized environment where alcohol content, both overt and subtle, proliferates. This omnipresence contributes significantly to the normalization of drinking, often blurring the lines between responsible consumption and problematic patterns.\n\n### Direct and Indirect Alcohol Marketing on Social Platforms\n\nAlcohol companies have recognized the immense reach and targeting capabilities of social media, shifting substantial portions of their advertising budgets to digital platforms [2]. This direct marketing often involves sophisticated campaigns designed to engage users, build brand loyalty, and ultimately drive consumption. Beyond traditional advertisements, brands employ creative strategies such as contests, giveaways, and interactive games to gain followers and embed their products within the social fabric of online communities. For instance, companies like Fireball Cinnamon Whisky utilize daily giveaways on platforms like X, while Coors Brewing Company promotes apps that reward consumers for engaging with their brand online [2].\n\nHowever, the influence extends beyond direct marketing. Indirect marketing, often through influencers and user-generated content, plays an equally powerful role. Influencers, often with large and dedicated followings, showcase alcohol consumption as an integral part of desirable lifestyles, vacations, and social gatherings. This subtle endorsement can be particularly effective, as it often feels more authentic and relatable than traditional advertising, making the consumption of alcohol appear aspirational and commonplace.\n\n### User-Generated Content: The Illusion of Social Norms\n\nPerhaps one of the most potent forces in the digital landscape of alcohol is user-generated content (UGC). This includes photos, videos, and posts from friends, family, and acquaintances depicting their own alcohol consumption. While seemingly innocuous, UGC creates an illusion of social norms, suggesting that frequent or heavy drinking is a widespread and accepted part of social life. Studies indicate that seeing friends and schoolmates drinking on social media can motivate individuals, particularly adolescents, to mimic these behaviors [2]. This phenomenon is rooted in Social Learning Theory, where individuals learn by observing and imitating others, especially those within their social circles [3].\n\nThe overwhelming majority of alcohol-related posts on social media depict drinking in a positive social context, often showcasing celebratory events, parties, or relaxed gatherings [3]. This curated positivity rarely, if ever, shows the negative consequences of excessive drinking, such as hangovers, health issues, or impaired judgment. This selective portrayal reinforces positive alcohol expectancies – beliefs that alcohol consumption leads to positive outcomes like increased sociability, reduced anxiety, or enhanced enjoyment. The constant stream of such content can lead individuals to overestimate the prevalence and acceptability of heavy drinking among their peers, thereby increasing their own likelihood of engaging in similar behaviors.\n\n### The Power of Peer Influence in the Online Realm\n\nPeer influence, a well-established factor in alcohol consumption, is amplified and transformed in the online realm. Social media platforms facilitate constant exposure to peer behaviors, making it difficult to escape the perceived pressure to conform. The interactive nature of these platforms, with features like \n\n\nlikes, shares, and comments, creates a feedback loop that can reinforce alcohol-related behaviors. When individuals post about their drinking experiences and receive positive affirmation, it can strengthen their belief that such behaviors are socially acceptable and even desirable. This digital validation can be a powerful motivator, particularly for those seeking acceptance or struggling with self-esteem.\n\nMoreover, the perceived anonymity of online interactions can lower inhibitions, leading individuals to post more freely about their alcohol consumption than they might in face-to-face settings. This can create a distorted sense of reality, where risky drinking behaviors appear more common and less consequential than they are in actuality. The constant exposure to these amplified peer behaviors can make it challenging for individuals, especially young people, to develop a healthy and balanced perspective on alcohol.\n\n## Psychological Mechanisms: How Social Media Shapes Alcohol Expectancies\n\nThe influence of social media on drinking behaviors is not merely a matter of exposure; it operates through complex psychological mechanisms that shape individuals’ beliefs and expectations about alcohol. These alcohol expectancies, which are beliefs regarding the effects of alcohol (e.g., tension reduction, increased sociability), play a crucial role in determining drinking patterns and risk for problematic use. Social media, through its unique characteristics, significantly contributes to the formation and reinforcement of these expectancies.\n\n### Social Learning Theory: Learning from Digital Role Models\n\nSocial Learning Theory posits that individuals learn behaviors by observing others, particularly those they admire or identify with. In the digital age, social media platforms provide an endless stream of potential role models, both real and aspirational. When individuals observe their peers, influencers, or even celebrities engaging in alcohol consumption, especially when it is portrayed positively, they are more likely to internalize these behaviors as acceptable or desirable [3]. This observational learning is amplified by the visual nature of social media, where images and videos of drinking can be particularly impactful.\n\nFor instance, a study found that social media posts overwhelmingly (97%) depict alcohol in a positive social context, with a significant portion (67%) showing people holding drinks [3]. These visual cues, combined with the positive reinforcement (likes, comments) that often accompanies such posts, create a powerful learning environment. Adolescents, in particular, are susceptible to this form of learning, as they are often in a developmental stage where they are highly attuned to peer behaviors and seeking social validation.\n\n### The Reinforcement Cycle: Likes, Shares, and Validation\n\nSocial media platforms are designed to create engagement through various reinforcement mechanisms, such as likes, shares, comments, and followers. When individuals post content related to alcohol and receive positive feedback, it triggers a reinforcement cycle. This positive validation can strengthen the association between alcohol consumption and positive social outcomes, thereby reinforcing positive alcohol expectancies. The more positive feedback received, the stronger the reinforcement, and the more likely the individual is to repeat the behavior.\n\nThis cycle can be particularly insidious because it taps into fundamental human needs for connection and validation. The desire for social acceptance can lead individuals to conform to perceived norms, even if those norms involve risky drinking behaviors. The immediate gratification of likes and comments can overshadow the potential long-term negative consequences of excessive alcohol consumption, creating a powerful incentive to continue posting and engaging with alcohol-related content.\n\n### Problematic Social Media Use and Its Link to Alcohol Behaviors\n\nBeyond general social media use, problematic social media use (PSMU) has been identified as a significant factor in shaping alcohol behaviors. PSMU, characterized by elements similar to addiction (e.g., mood modification, tolerance, withdrawal, conflict, relapse), can be directly linked to both positive and negative alcohol expectancies [3]. Individuals who exhibit PSMU may be more susceptible to the influence of alcohol-related content due to their heightened engagement with digital platforms and their potential for addictive behaviors.\n\nWhile time spent on social media alone may not be a strong predictor of alcohol expectancies, the *problematic* nature of the use is. This suggests that it is not merely the exposure to alcohol content, but the compulsive and often uncontrolled engagement with social media that contributes to risky drinking behaviors. Individuals with PSMU may use social media as a coping mechanism, and if alcohol is frequently portrayed as a solution to stress or a means of social connection, it can reinforce these problematic associations.\n\n## The Rise of Mindful Drinking: A Counter-Narrative in the Digital Age\n\nAmidst the pervasive influence of alcohol culture on social media, a powerful counter-narrative is emerging: the rise of mindful drinking. This movement, gaining significant traction particularly among younger generations, represents a conscious shift away from unexamined alcohol consumption towards a more intentional and health-conscious approach. It challenges the traditional norms of drinking and offers alternative pathways to social connection and well-being.\n\n### Gen Z and Millennials: Redefining Alcohol Consumption\n\nGen Z and Millennials are at the forefront of this redefinition of alcohol consumption. Unlike previous generations, who may have viewed social drinking as an indispensable part of their social lives, these cohorts are increasingly prioritizing health, wellness, and social awareness [4]. This has led to a notable trend of reduced alcohol consumption, increased abstinence, and a greater openness to alcohol-free alternatives. For many in Gen Z, for instance, nearly half of non-drinkers are simply not interested in alcohol, while a significant portion abstains due to concerns about health and mental well-being [4].\n\nThis shift is driven by a heightened awareness of the potential negative impacts of alcohol, including its effects on mental health (e.g., 'hang-xiety,' depression, stress) and the risk of addiction. Having grown up with unprecedented access to health information through the internet and social media, these generations are acutely aware of the risks associated with alcohol. This knowledge empowers them to make more informed choices, leading to a more balanced and often moderated approach to drinking.\n\n### The Wellness Movement: Prioritizing Health Over Habit\n\nMindful drinking is an integral part of the broader wellness movement, which emphasizes holistic well-being encompassing physical, mental, and emotional health. As individuals increasingly prioritize self-care and personal growth, they are re-evaluating their relationship with alcohol. The focus shifts from habitual consumption to intentional choices that align with their overall health goals. This includes exploring alternatives to alcohol that still allow for social engagement without compromising wellness objectives, such as sophisticated mocktails and adaptogenic beverages [5].\n\nThe wellness movement also encourages a more critical perspective on societal norms and pressures. It empowers individuals to challenge the idea that alcohol is necessary for social enjoyment or relaxation, promoting a culture where personal well-being takes precedence over perceived social obligations. This cultural shift is evident in the growing popularity of alcohol-free events, sober bars, and wellness-focused communities that offer alternative spaces for connection and celebration.\n\n### The Sober Curious Trend: Exploring Alcohol-Free Lifestyles\n\nThe \n\n\nsober curious trend is a significant manifestation of the mindful drinking movement. It describes a growing number of individuals who choose to reduce or eliminate alcohol consumption, not necessarily due to a history of alcohol dependence, but out of a desire to improve their overall health, mental clarity, and well-being. This trend is fueled by a combination of factors, including increased awareness of alcohol's negative effects, the desire for better sleep and energy levels, and the appeal of a lifestyle free from hangovers and impaired judgment.\n\nThe digital age, ironically, has played a crucial role in the proliferation of the sober curious movement. Social media platforms, while often promoting alcohol, also serve as powerful tools for sharing information, building communities, and normalizing alcohol-free lifestyles. Individuals can find support groups, discover alcohol-free recipes, and connect with others who share similar goals, creating a positive feedback loop that reinforces their choices. Hashtags like #sobercurious and #mindfuldrinking have become popular, allowing individuals to share their journeys and inspire others.\n\n## Navigating the Digital Minefield: Strategies for Alcohol Wellness\n\nGiven the pervasive influence of social media on alcohol perceptions and behaviors, it is crucial for individuals to develop strategies to navigate this digital minefield consciously. Empowering oneself with knowledge and practical tools can help mitigate negative influences and foster a healthier relationship with alcohol and digital platforms.\n\n### Digital Detox and Mindful Engagement\n\nOne of the most effective strategies is to practice digital detox and mindful engagement. A digital detox involves intentionally disconnecting from social media for a period, allowing for a reset and a re-evaluation of one's relationship with these platforms. Even short breaks can significantly reduce exposure to alcohol-related content and provide an opportunity to engage in real-world activities that promote well-being.\n\nMindful engagement, on the other hand, involves being present and intentional when using social media. This means actively questioning the content consumed, recognizing the curated nature of online portrayals, and being aware of how certain posts might influence one's thoughts or feelings about alcohol. Before engaging with alcohol-related content, individuals can pause and reflect on their motivations and potential triggers.\n\n### Curating Your Feed: Unfollowing and Muting Alcohol-Related Content\n\nSocial media algorithms are designed to show users more of what they engage with. Therefore, actively curating one's feed is a powerful way to reduce exposure to unwanted alcohol content. This involves unfollowing accounts that frequently post about alcohol, muting keywords or hashtags related to drinking, and utilizing privacy settings to limit the visibility of alcohol-related advertisements. Many platforms offer tools to customize content preferences, and leveraging these can create a more supportive and less triggering online environment.\n\n### Building Real-World Connections and Support Systems\n\nWhile social media offers a sense of connection, it often lacks the depth and authenticity of real-world relationships. Prioritizing and nurturing in-person connections and building strong support systems can provide a vital buffer against negative digital influences. Engaging in activities that foster genuine human interaction, joining clubs or groups with shared interests, and spending quality time with friends and family can reduce reliance on social media for validation and belonging. These real-world connections can offer emotional support, accountability, and alternative avenues for social enjoyment that do not revolve around alcohol.\n\n### Seeking Professional Help: When Digital Influence Becomes Problematic\n\nFor some individuals, the influence of social media on their drinking habits may become problematic, leading to increased consumption, cravings, or even alcohol use disorder. In such cases, seeking professional help is crucial. Therapists, counselors, and addiction specialists can provide personalized guidance, coping strategies, and support to address underlying issues and develop healthier behaviors. Online resources and telehealth options have also made professional help more accessible, allowing individuals to seek support discreetly and conveniently.\n\n## The Role of DHM in Supporting Alcohol Wellness (Non-Promotional)\n\nDihydromyricetin (DHM), a natural flavonoid derived from the Hovenia dulcis tree, has garnered attention for its potential role in supporting alcohol wellness. While not a cure for alcohol-related issues, scientific research suggests that DHM can offer benefits related to alcohol metabolism and liver health, making it a relevant consideration within a holistic approach to managing alcohol consumption. It is crucial to emphasize that DHM should not be viewed as a license to drink excessively or as a substitute for responsible drinking habits and professional medical advice.\n\n### Understanding DHM: A Natural Compound for Liver Support\n\nDHM is primarily known for its ability to counteract some of the acute effects of alcohol intoxication. It has been traditionally used in East Asian medicine as a hangover remedy. Modern scientific inquiry has begun to unravel the mechanisms behind these traditional uses, revealing its potential to support the body's natural processes in dealing with alcohol. Its primary action involves enhancing the activity of enzymes responsible for breaking down alcohol in the liver, thereby potentially reducing the duration and severity of alcohol's effects on the body.\n\n### Scientific Insights: DHM's Impact on Alcohol Metabolism and Liver Health\n\nResearch indicates that DHM helps the body metabolize alcohol faster by activating a cascade of mechanisms [6]. Specifically, studies have shown that DHM can enhance the activity of alcohol dehydrogenase (ADH) and aldehyde dehydrogenase (ALDH), the two primary enzymes involved in alcohol breakdown. ADH converts alcohol to acetaldehyde, a toxic compound, and ALDH then converts acetaldehyde into acetate, a less harmful substance. By boosting the efficiency of these enzymes, DHM may help to clear alcohol and its toxic byproducts from the system more quickly.\n\nBeyond its role in alcohol metabolism, DHM has also demonstrated protective effects on the liver. Alcohol consumption, particularly chronic and excessive intake, can lead to liver damage, including fatty liver disease, alcoholic hepatitis, and cirrhosis. Research suggests that DHM can reduce ethanol-induced liver injury through several pathways, including changes in lipid metabolism, further enhancement of ethanol metabolism, and suppression of inflammatory responses [6]. This multi-faceted action makes DHM a promising compound for supporting liver health in individuals who consume alcohol.\n\nFor instance, a study highlighted that DHM acts on multiple pathways to promote liver health and counteract ethanol injury, suggesting its utility as a dietary supplement to reduce ethanol-induced liver injury [6]. This could have significant implications for individuals at risk of liver damage due to alcohol, potentially extending the function of the organ long enough for them to seek and receive help for problematic drinking habits.\n\n### Integrating DHM into a Holistic Wellness Approach\n\nIt is vital to reiterate that DHM is not a magic bullet for alcohol-related problems. Its benefits are best realized when integrated into a comprehensive and holistic approach to alcohol wellness. This includes practicing mindful drinking, setting limits, avoiding binge drinking, maintaining a balanced diet, engaging in regular physical activity, and seeking professional guidance when needed. DHM can serve as a supportive tool within this broader framework, aiding the body's natural detoxification processes and offering some liver protection, but it does not negate the importance of responsible alcohol consumption and overall healthy lifestyle choices.\n\n## Conclusion: Empowering Choices in a Connected World\n\nIn an increasingly digital world, the influence of social media on our relationship with alcohol is undeniable. From subtle marketing tactics to the pervasive normalization of drinking through user-generated content, digital culture profoundly shapes our perceptions and behaviors. However, understanding these influences is the first step towards empowering ourselves to make conscious and healthy choices.\n\n### Reclaiming Agency: Your Relationship with Alcohol and Social Media\n\nReclaiming agency over your relationship with alcohol and social media involves a conscious effort to challenge prevailing norms and cultivate a mindful approach. This means recognizing the curated reality presented online, understanding the psychological mechanisms that drive alcohol expectancies, and actively curating your digital environment to support your wellness goals. It's about shifting from passive consumption of digital content to active, intentional engagement that aligns with your personal values and health aspirations.\n\n### A Call to Action: Fostering a Healthier Digital Culture\n\nBeyond individual strategies, there is a collective responsibility to foster a healthier digital culture around alcohol. This involves advocating for more responsible marketing practices from alcohol companies, promoting media literacy among users, and encouraging platforms to implement features that support mindful consumption and discourage problematic behaviors. Educators, parents, and public health organizations also have a crucial role to play in raising awareness and providing resources for navigating the complexities of alcohol wellness in the digital age.\n\n### Final Thoughts: Embracing a Balanced and Mindful Future\n\nThe rise of mindful drinking and the sober curious movement signals a promising shift towards a more balanced and health-conscious approach to alcohol. By embracing these trends, leveraging supportive tools like DHM responsibly, and making informed choices about our digital engagement, we can cultivate a future where alcohol consumption is a deliberate decision rather than a reaction to pervasive digital influences. Ultimately, navigating alcohol wellness in a socially-connected world requires a blend of personal responsibility, critical thinking, and a commitment to holistic well-being.\n\n\n\n\n## References\n\n[1] Moreno, M. A., & Whitehill, J. M. (2014). Influence of Social Media on Alcohol Use in Adolescents and Young Adults. *Alcohol Research*, 36(1), 91–100. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC4432862/](https://pmc.ncbi.nlm.nih.gov/articles/PMC4432862/)\n\n[2] DrugRehab.com. (2020, February 28). *Social Media and Alcohol | Social Media’s Influence on Drinking*. Available at: [https://www.drugrehab.com/addiction/alcohol/influence-of-social-media/](https://www.drugrehab.com/addiction/alcohol/influence-of-social-media/)\n\n[3] Nagata, J. M., Smith, N., Zamora, G., Sajjad, O. M., Ganson, K. T., Testa, A., & Jackson, D. B. (2023). Problematic social media use and alcohol expectancies in early adolescents. *BMC Public Health*, 23(1), 430. Available at: [https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-023-15298-3](https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-023-15298-3)\n\n[4] Attest. (2025, April 30). *US Gen Z Alcohol Trends: Insights & Innovations for 2025*. Available at: [https://www.askattest.com/blog/research/gen-z-alcohol-trends](https://www.askattest.com/blog/research/gen-z-alcohol-trends)\n\n[5] Spa Executive. (2024, November 14). *2025 WELLNESS TRENDS: A world of alcohol alternatives*. Available at: [https://spaexecutive.com/2024/11/14/2025-wellness-trends-a-a-world-of-alcohol-alternatives/](https://spaexecutive.com/2024/11/14/2025-wellness-trends-a-a-world-of-alcohol-alternatives/)\n\n[6] USC Today. (2020, April 7). *Noted hangover remedy DHM has added benefit of protecting the liver*. Available at: [https://today.usc.edu/hangover-remedy-dhm-liver-protection-usc-study/](https://today.usc.edu/hangover-remedy-dhm-liver-protection-usc-study/)\n\n\n\n\n[7] Steers, M. N., Strowger, M., Tanygin, A. B., Ward, R. M., & Nolfi, D. A. (2025). The Relationship Between Alcohol-Related Content on Social Media and Alcohol Outcomes in Young Adults: A Scoping Review. *Alcohol Research*, 45(1), 04. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC11960810/](https://pmc.ncbi.nlm.nih.gov/articles/PMC11960810/)\n\n\n\n\n[8] Curtis, B. L., Lookatch, S. J., Ramo, D. E., McKay, J. R., Feinn, R. S., & Kranzler, H. R. (2018). Meta-analysis of the association of alcohol-related social media use with alcohol consumption and alcohol-related problems in adolescents and young adults. *Alcoholism: Clinical and Experimental Research*, 42(6), 978–986. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC5984178/](https://pmc.ncbi.nlm.nih.gov/articles/PMC5984178/)\n\n\n\n\n[9] Riehm, K. E., Thrul, J., Barrington-Trimis, J. L., Kelleghan, A., Mojtabai, R., & Leventhal, A. M. (2021). Prospective Association of Digital Media Use with Alcohol Use Initiation and Progression Among Adolescents. *Alcoholism: Clinical and Experimental Research*, 45(4), 877–885. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC8076081/](https://pmc.ncbi.nlm.nih.gov/articles/PMC8076081/)\n\n\n\n\n[10] Finan, L. J., Lipperman-Kreda, S., Grube, J. W., Balassone, A., & Kaner, E. (2020). Alcohol Marketing and Adolescent and Young Adult Alcohol Use Behaviors: A Systematic Review of Cross-Sectional Studies. *Journal of Studies on Alcohol and Drugs, Supplement*, (Suppl 19), 42–56. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC7063997/](https://pmc.ncbi.nlm.nih.gov/articles/PMC7063997/)\n\n\n\n\n[11] Silva, J., Yu, X., Moradian, R., Folk, C., Spatz, M. H., Kim, P., ... & Liang, J. (2020). Dihydromyricetin Protects the Liver via Changes in Lipid Metabolism and Enhanced Ethanol Metabolism. *Alcoholism: Clinical and Experimental Research*, 44(5), 1046–1060. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC7211127/](https://pmc.ncbi.nlm.nih.gov/articles/PMC7211127/)\n\n\n\n\n[12] McCreanor, T., Moewaka Barnes, A., Goodwin, I., Carah, N., Young, J., & Spicer, J. (2025). Alcohol marketing on social media: young people’s exposure, engagement and alcohol-related behaviors. *Addiction Research & Theory*, 33(3), 161–171. Available at: [https://www.tandfonline.com/doi/full/10.1080/16066359.2024.2373145](https://www.tandfonline.com/doi/full/10.1080/16066359.2024.2373145)\n\n\n\n\n[13] Noel, J. K., Sammartino, C. J., & Rosenthal, S. R. (2020). Exposure to Digital Alcohol Marketing and Alcohol Use: A Systematic Review. *Journal of Studies on Alcohol and Drugs, Supplement*, (Suppl 19), 57–67. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC7064004/](https://pmc.ncbi.nlm.nih.gov/articles/PMC7064004/)\n\n\n\n\n[14] National Institute on Alcohol Abuse and Alcoholism. (2024, September 12). Sober-Curious Young Americans May Be Changing the Conversation Around Alcohol. *Spectrum*, 16(3). Available at: [https://www.niaaa.nih.gov/news-events/spectrum/volume-16-issue-3-fall-2024/sober-curious-young-americans-may-be-changing-conversation-around-alcohol](https://www.niaaa.nih.gov/news-events/spectrum/volume-16-issue-3-fall-2024/sober-curious-young-americans-may-be-changing-conversation-around-alcohol)\n\n\n\n\n[15] Brunborg, G. S., & Andreas, J. B. (2022). Time spent on social media and alcohol use among adolescents: A longitudinal study. *Addictive Behaviors*, 130, 107294. Available at: [https://pubmed.ncbi.nlm.nih.gov/35231842/](https://pubmed.ncbi.nlm.nih.gov/35231842/)\n\n\n\n\n[16] McClure, A. C., Gabrielli, J., Cukier, S., Jackson, K. M., Brennan, Z. L. B., & Tanski, S. E. (2020). Internet Alcohol Marketing Recall and Drinking in Underage Adolescents. *Academic Pediatrics*, 20(1), 128–135. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC7055537/](https://pmc.ncbi.nlm.nih.gov/articles/PMC7055537/)\n\n\n\n\n[17] Bonar, E. E., Bauermeister, J. A., Blow, F. C., Bohnert, A. S. B., Bourque, C., Coughlin, L. N., ... & Walton, M. A. (2022). A Randomized Controlled Trial of Social Media Interventions for Risky Drinking among Adolescents and Emerging Adults. *Drug and Alcohol Dependence*, 237, 109532. Available at: [https://pmc.ncbi.nlm.nih.gov/articles/PMC9745675/](https://pmc.ncbi.nlm.nih.gov/articles/PMC9745675/)\n\n\n\n\n[18] Nicoletti, A. (2023, July 13). Teens more likely to use alcohol and marijuana if they see their friends post about it on social media. *FIU News*. Available at: [https://news.fiu.edu/2023/teens-more-likely-to-use-alcohol-and-marijuana-if-they-see-their-friends-post-about-it-on-social-media](https://news.fiu.edu/2023/teens-more-likely-to-use-alcohol-and-marijuana-if-they-see-their-friends-post-about-it-on-social-media)\n\n\n\n\n[19] Alcohol and Drug Foundation. (2025, May 26). Alcohol Advertising, Social Media and Young People. Available at: [https://adf.org.au/talking-about-drugs/alcohol-advertising-social-media-youth/](https://adf.org.au/talking-about-drugs/alcohol-advertising-social-media-youth/)\n\n\n\n\n[20] Somers, G. (n.d.). Social Media’s Role in Adolescent Substance Use. *TYDE*. Available at: [https://tyde.virginia.edu/social-media-substance-abuse/](https://tyde.virginia.edu/social-media-substance-abuse/)\n\n\n\n\n[21] National Institute on Alcohol Abuse and Alcoholism. (2024, May 7). Digital Health Technology Shows Promise for Efforts To Address Drinking Among Youth. *Spectrum*, 16(2). Available at: [https://www.niaaa.nih.gov/news-events/spectrum/volume-16-issue-2-spring-2024/digital-health-technology-shows-promise-efforts-address-drinking-among-youth](https://www.niaaa.nih.gov/news-events/spectrum/volume-16-issue-2-spring-2024/digital-health-technology-shows-promise-efforts-address-drinking-among-youth)\n\n\n\n\n[22] Strowger, M., Meisel, M. K., Haikalis, M., Rogers, M. L., & Barnett, N. P. (2024). Associations between frequency of exposure to peer-generated alcohol-related posts and alcohol use within a social network of college students. *Addictive Behaviors*, 152, 107956. Available at: [https://www.sciencedirect.com/science/article/abs/pii/S0306460324000054](https://www.sciencedirect.com/science/article/abs/pii/S0306460324000054)\n\n\n\n\n[23] Ng Fat, L., Cable, N., & Kelly, Y. (2021). Associations between social media usage and alcohol use among youths and young adults: findings from Understanding Society. *Addiction*, 116(11), 2995–3005. Available at: [https://pubmed.ncbi.nlm.nih.gov/33886119/](https://pubmed.ncbi.nlm.nih.gov/33886119/)\n\n\n"
}